vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE246_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_imx8" Cversion="2.0.0" condition="component.silicon_id_imx8.condition_id">
      <description>Driver silicon_id imx8</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imx8/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_imx93" Cversion="2.0.0" condition="component.silicon_id_imx93.condition_id">
      <description>Driver silicon_id imx93</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imx93/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt10xx" Cversion="2.0.0" condition="component.silicon_id_imxrt10xx.condition_id">
      <description>Driver silicon_id rt10xx</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/rt10xx/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt1170" Cversion="2.0.0" condition="component.silicon_id_imxrt1170.condition_id">
      <description>Driver silicon_id imxrt1170</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imxrt1170/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt1180" Cversion="2.0.0" condition="component.silicon_id_imxrt1180.condition_id">
      <description>Driver silicon_id imxrt1180</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imxrt1180/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxe31x" Cversion="2.0.0" condition="component.silicon_id_mcxe31x.condition_id">
      <description>Driver silicon_id mcxe31x</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/mcxe31x/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxn" Cversion="2.0.0" condition="component.silicon_id_mcxn.condition_id">
      <description>Driver silicon_id mcxn</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/mcxn/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rw610" Cversion="2.0.0" condition="component.silicon_id_rw610.condition_id">
      <description>Driver silicon_id rw610</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/rw610/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_scfw" Cversion="2.0.0" condition="component.silicon_id_scfw.condition_id">
      <description>Driver silicon_id scfw</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/scfw/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXE246_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXE246_cmsis</description>
      <files>
        <file category="header" name="devices/MCXE246/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXE246/MCXE246.h" projectpath="device"/>
        <file category="header" name="devices/MCXE246/MCXE246_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXE246/MCXE246_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_AIPS.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_CAN.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_CMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_CRC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_DMAMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_EIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_ELA_CSEC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_ERM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_EWM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_FTFC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_FTM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_LMEM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_LPI2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_LPIT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_LPSPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_MCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_MSCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_NV.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_PCC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_PDB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_PMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_RCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_SCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_SIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_SMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_SYSMPU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_TRGMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXE246/periph2/PERI_WDOG.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXE246/"/>
        <file category="include" name="devices/MCXE246/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXE246/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXE246/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXE246_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXE246_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXE246.condition_id" category="linkerScript" attr="config" name="devices/MCXE246/arm/MCXE246_flash.scf" version="1.0.0" projectpath="MCXE246/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXE246.condition_id" category="linkerScript" attr="config" name="devices/MCXE246/arm/MCXE246_ram.scf" version="1.0.0" projectpath="MCXE246/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXE246.condition_id" category="linkerScript" attr="config" name="devices/MCXE246/gcc/MCXE246_flash.ld" version="1.0.0" projectpath="MCXE246/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXE246.condition_id" category="linkerScript" attr="config" name="devices/MCXE246/gcc/MCXE246_ram.ld" version="1.0.0" projectpath="MCXE246/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXE246.condition_id" category="linkerScript" attr="config" name="devices/MCXE246/iar/MCXE246_flash.icf" version="1.0.0" projectpath="MCXE246/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXE246.condition_id" category="linkerScript" attr="config" name="devices/MCXE246/iar/MCXE246_ram.icf" version="1.0.0" projectpath="MCXE246/iar"/>
      </files>
    </component>
