vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE246_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.10.0" condition="driver.lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MCXE246/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE246/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE246/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.6.0" condition="driver.lpuart_edma.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MCXE246/drivers/fsl_lpuart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE246/drivers/fsl_lpuart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE246/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lsm6dso" Cversion="1.0.0" condition="driver.lsm6dso.condition_id">
      <description>Driver lsm6dso</description>
      <files>
        <file category="header" name="components/sensor/lsm6dso/fsl_lsm.h" projectpath="tilt_pedo"/>
        <file category="sourceC" name="components/sensor/lsm6dso/fsl_lsm.c" projectpath="tilt_pedo"/>
        <file category="include" name="components/sensor/lsm6dso/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="max30101" Cversion="1.0.0" condition="driver.max30101.condition_id">
      <description>Driver max30101</description>
      <files>
        <file category="header" name="components/sensor/max30101/fsl_max.h" projectpath="heartrate"/>
        <file category="sourceC" name="components/sensor/max30101/fsl_max.c" projectpath="heartrate"/>
        <file category="include" name="components/sensor/max30101/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mcm" Cversion="2.2.0" condition="driver.mcm.condition_id">
      <description>MCM Driver</description>
      <files>
        <file category="header" name="devices/MCXE246/drivers/fsl_mcm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE246/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/sensor/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="driver.mma8652fc.condition_id">
      <description>Driver mma8652fc</description>
      <files>
        <file category="header" name="components/sensor/mma8652fc/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8652fc/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8652fc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="p3t1755" Cversion="2.0.0" condition="driver.p3t1755.condition_id">
      <description>Driver p3t1755</description>
      <files>
        <file category="header" name="components/sensor/p3t1755/fsl_p3t1755.h" projectpath="component/p3t1755"/>
        <file category="sourceC" name="components/sensor/p3t1755/fsl_p3t1755.c" projectpath="component/p3t1755"/>
        <file category="include" name="components/sensor/p3t1755/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pdb" Cversion="2.0.4" condition="driver.pdb.condition_id">
      <description>PDB Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE246/drivers/fsl_pdb.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE246/drivers/fsl_pdb.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE246/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pmc" Cversion="2.0.3" condition="driver.pmc.condition_id">
      <description>PMC Driver</description>
      <files>
        <file category="header" name="devices/MCXE246/drivers/fsl_pmc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE246/drivers/fsl_pmc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE246/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="port" Cversion="2.5.1" condition="driver.port.condition_id">
      <description>PORT Driver</description>
      <files>
        <file category="header" name="devices/MCXE246/drivers/fsl_port.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE246/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rcm" Cversion="2.0.4" condition="driver.rcm.condition_id">
      <description>RCM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE246/drivers/fsl_rcm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE246/drivers/fsl_rcm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE246/drivers/"/>
      </files>
    </component>
